In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://github.com/YBIFoundation/Dataset/raw/main/TheTitanic.csv')
df.head()

,1,2,3,4,5,6,7,8,9,10
0,sn,pclass,survived,NaN,gender,age,family,fare,embarked,date
1,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
2,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
3,2,3,0,Master. Eugene Joseph,male,?,2,20.25,S,02-Jan-90
4,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,NaN,2,**,S,03-Jan-90

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1302 entries, 0 to 1301
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       1302 non-null   object
 1   2       1302 non-null   object
 2   3       1302 non-null   object
 3   4       1301 non-null   object
 4   5       1301 non-null   object
 5   6       1045 non-null   object
 6   7       1300 non-null   object
 7   8       1300 non-null   object
 8   9       1296 non-null   object
 9   10      1302 non-null   object
dtypes: object(10)
memory usage: 101.8+ KB

In [7]:
df.columns = ['sn', 'pclass', 'survived', 'name', 'gender', 'age', 'family', 'fare', 'embarked', 'date']
df['age'] = pd.to_numeric(df['age'], errors='coerce') 
df['fare'] = pd.to_numeric(df['fare'], errors='coerce')

In [8]:
df['date'] = pd.to_datetime(df['date'], format='%d-%b-%y', errors='coerce')

In [9]:
df['embarked'].fillna(df['embarked'].mode()[0], inplace=True)

/var/folders/b8/5mb145nj6cz_15vvnmwt9st40000gn/T/ipykernel_44292/1964997694.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['embarked'].fillna(df['embarked'].mode()[0], inplace=True)

In [10]:
df['age'].fillna(df['age'].median(), inplace=True)

/var/folders/b8/5mb145nj6cz_15vvnmwt9st40000gn/T/ipykernel_44292/1654433547.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].median(), inplace=True)

In [11]:
df['fare'].fillna(df['fare'].median(), inplace=True)

/var/folders/b8/5mb145nj6cz_15vvnmwt9st40000gn/T/ipykernel_44292/4242156193.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['fare'].fillna(df['fare'].median(), inplace=True)

In [12]:
df['gender'].fillna(df['gender'].mode()[0], inplace=True)

/var/folders/b8/5mb145nj6cz_15vvnmwt9st40000gn/T/ipykernel_44292/1062339567.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].fillna(df['gender'].mode()[0], inplace=True)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1302 entries, 0 to 1301
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sn        1302 non-null   object
 1   pclass    1302 non-null   object
 2   survived  1302 non-null   object
 3   name      1301 non-null   object
 4   gender    1302 non-null   object
 5   age       1302 non-null   float64
 6   family    1300 non-null   object
 7   fare      1302 non-null   float64
 8   embarked  1302 non-null   object
 9   date      1301 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(7)
memory usage: 101.8+ KB

In [16]:
df.head()

,sn,pclass,survived,name,gender,age,family,fare,embarked,date
0,sn,pclass,survived,NaN,gender,28.0,family,14.4542,embarked,NaT
1,1,3,0,Mr. Anthony,male,42.0,0,7.5500,S,1990-01-01
2,1,3,0,Mr. Anthony,male,42.0,0,7.5500,S,1990-01-01
3,2,3,0,Master. Eugene Joseph,male,28.0,2,20.2500,S,1990-01-02
4,3,2,0,"Abbott, Mr. Rossmore Edward",male,28.0,2,14.4542,S,1990-01-03